Revit 2027 API
DocumentChangedEventArgs.GetDeletedElementIds Method
 Returns set of elements that were deleted from the document.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetDeletedElementIds()
Public Function GetDeletedElementIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetDeletedElementIds()
member GetDeletedElementIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 The set of ElementId for elements that were deleted from the document.
See Also
Reference
DocumentChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace